src/main/resources/templates/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.gonzik28.com/community/gen">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getLoginRequest>
            <gs:login>@anton</gs:login>
        </gs:getLoginRequest>
    </soapenv:Body>
</soapenv:Envelope>